/*
 * lesson5/c_c++/homework/homework5_10.c
 * Напишите процедуру которая выводит переданное ей число прописью. Например 21
 * -> "двадцать один".
 */
#include <stdio.h>

void numberIfWords(int numb_n) {
    switch (numb_n) {
        case 1: printf("один!\n");
                break;
        case 2: printf("два!\n");
                break;
        case 3: printf("три!\n");
                break;
        case 4: printf("четыре!\n");
                break;
        case 5: printf("пять!\n");
                break;
        case 6: printf("шесть!\n");
                break;
        case 7: printf("семь!\n");
                break;
        case 8: printf("восемь!\n");
                break;
        case 9: printf("девять!\n");
                break;
        case 10: printf("десять!\n");
                 break;
        case 11: printf("одиннадцать!\n");
                 break;
        case 12: printf("двенадцать!\n");
                 break;
        case 13: printf("тринадцать!\n");
                 break;
        case 14: printf("четырнадцать!\n");
                 break;
        case 15: printf("пятнадцать!\n");
                 break;
        case 16: printf("шестнадцать!\n");
                 break;
        case 17: printf("семнадцать!\n");
                 break;
        case 18: printf("восемнадцать!\n");
                 break;
        case 19: printf("девятнадцать!\n");
                 break;
        case 20: printf("двадцать!\n");
                 break;
        case 21: printf("двадцать одно!\n");
                 break;
        case 22: printf("двадцать два!\n");
                 break;
        case 23: printf("двадцать три!\n");
                 break;
        case 24: printf("двадцать четыре!\n");
                 break;
        case 25: printf("двадцать пять!\n");
                 break;
        case 26: printf("двадцать шесть!\n");
                 break;
        case 27: printf("двадцать семь!\n");
                 break;
        case 28: printf("двадцать восемь!\n");
                 break;
        case 29: printf("двадцать девять!\n");
                 break;
        case 30: printf("тридцать!\n");
                 break;
        case 31: printf("тридцать один!\n");
                 break;
        case 32: printf("тридцать два!\n");
                 break;
        case 33: printf("тридцать три!\n");
                 break;
        case 34: printf("тридцать четыре!\n");
                 break;
        case 35: printf("тридцать пять!\n");
                 break;
        case 36: printf("тридцать шесть!\n");
                 break;
        case 37: printf("тридцать семь!\n");
                 break;
        case 38: printf("тридцать восемь!\n");
                 break;
        case 39: printf("тридцать девять!\n");
                 break;
        case 40: printf("сорок!\n");
                 break;
        case 41: printf("сорок один!\n");
                 break;
        case 42: printf("сорок два!\n");
                 break;
        case 43: printf("сорок три!\n");
                 break;
        case 44: printf("сорок четыре!\n");
                 break;
        case 45: printf("сорок пять!\n");
                 break;
        case 46: printf("сорок шесть!\n");
                 break;
        case 47: printf("сорок семь!\n");
                 break;
        case 48: printf("сорок восемь!\n");
                 break;
        case 49: printf("сорок девять!\n");
                 break;
        case 50: printf("пятьдесят!\n");
                 break;
        case 51: printf("пятьдесят один!\n");
                 break;
        case 52: printf("пятьдесят два!\n");
                 break;
        case 53: printf("пятьдесят три!\n");
                 break;
        case 54: printf("пятьдесят четыре!\n");
                 break;
        case 55: printf("пятьдесят пять!\n");
                 break;
        case 56: printf("пятьдесят шесть!\n");
                 break;
        case 57: printf("пятьдесят семь!\n");
                 break;
        case 58: printf("пятьдесят восемь!\n");
                 break;
        case 59: printf("пятьдесят девять!\n");
                 break;
        case 60: printf("шестьдесят!\n");
                 break;
        case 61: printf("шестьдесят один!\n");
                 break;
        case 62: printf("шестьдесят два!\n");
                 break;
        case 63: printf("шестьдесят три!\n");
                 break;
        case 64: printf("шестьдесят четыре!\n");
                 break;
        case 65: printf("шестьдесят пять!\n");
                 break;
        case 66: printf("шестьдесят шесть!\n");
                 break;
        case 67: printf("шестьдесят семь!\n");
                 break;
        case 68: printf("шестьдесят восемь!\n");
                 break;
        case 69: printf("шестьдесят девять!\n");
                 break;
        case 70: printf("семьдесят!\n");
                 break;
        case 71: printf("семьдесят один!\n");
                 break;
        case 72: printf("семьдесят два!\n");
                 break;
        case 73: printf("семьдесят три!\n");
                 break;
        case 74: printf("семьдесят четыре!\n");
                 break;
        case 75: printf("семьдесят пять!\n");
                 break;
        case 76: printf("семьдесят шесть!\n");
                 break;
        case 77: printf("семьдесят семь!\n");
                 break;
        case 78: printf("семьдесят восемь!\n");
                 break;
        case 79: printf("семьдесят девять!\n");
                 break;
        case 80: printf("восемьдесят!\n");
                 break;
        case 81: printf("восемьдесят один!\n");
                 break;
        case 82: printf("восемьдесят два!\n");
                 break;
        case 83: printf("восемьдесят три!\n");
                 break;
        case 84: printf("восемьдесят четыре!\n");
                 break;
        case 85: printf("восемьдесят пять!\n");
                 break;
        case 86: printf("восемьдесят шесть!\n");
                 break;
        case 87: printf("восемьдесят восемь!\n");
                 break;
        case 88: printf("восемьдесят восемь!\n");
                 break;
        case 89: printf("восемьдесят девять!\n");
                 break;
        case 90: printf("девяносто!\n");
                 break;
        case 91: printf("девяносто один!\n");
                 break;
        case 92: printf("девяносто два!\n");
                 break;
        case 93: printf("девяносто три!\n");
                 break;
        case 94: printf("девяносто четыре!\n");
                 break;
        case 95: printf("девяносто пять!\n");
                 break;
        case 96: printf("девяносто шесть!\n");
                 break;
        case 97: printf("девяносто семь!\n");
                 break;
        case 98: printf("девяносто восемь!\n");
                 break;
        case 99: printf("девяносто девять!\n");
                 break;
        case 100: printf("сто!\n");
                  break;
        case 101: printf("сто один!\n");
                  break;
        default: printf("no such number!\n");
    }
}

int main() {
    int numb_i;
    printf("Введите число -> ");
    scanf("%d", &numb_i);
    numberIfWords(numb_i);
    return 0;
}
