#!/usr/bin/python3
#: lesson4/python3/homework/homework4_27.py
# Напишите программу, которая выводит на экран все цифры числа, начиная с
# первой.

numb = int(input("Введите число => "))

for i in range(1, numb+1):
    print("Все цифры числа =>", i)

